podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/XCVR_TX_DIG_MKW41Z4.svd.xml
            <register>
               <name>RF_DFT_BIST_1</name>
               <description>TX DFT Control 1</description>
               <addressOffset>0x1C</addressOffset>
               <fields>
                  <field>
                     <name>CTUNE_BIST_GO</name>
                     <description>Start the Coarse Tune BIST</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTUNE_BIST_FINISHED</name>
                     <description>Coarse Tune BIST has finished Tuning all Channels</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CTUNE_BIST_RESULT</name>
                     <description>Coarse Tune BIST Result</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CTUNE_BIST_THRSHLD</name>
                     <description>Maximum Difference Threshold for Coarse Tune BIST</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CTUNE_MAX_DIFF</name>
                     <description>Maximum Frequency Count Difference found by the Coarse Tune BIST</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CTUNE_MAX_DIFF_CH</name>
                     <description>Maximum Frequency Count Difference Radio Channel</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PA_AM_MOD_FREQ</name>
                     <description>RF Power Amplifier Amplitude Modulation Frequency</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>4 MHz</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>2 MHz</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>1 MHz</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>500 kHz</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>250 kHz</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101</name>
                           <description>125 kHz</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>110</name>
                           <description>62.5 kHz</description>
                           <value>0b110</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PA_AM_MOD_ENTRIES</name>
                     <description>RF Power Amplifier Amplitude Modulation Table Entries</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>001</name>
                           <description>2 entries</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>3 entries</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>4 entries</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>5 entries</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101</name>
                           <description>6 entries</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>110</name>
                           <description>7 entries</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>111</name>
                           <description>8 entries</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PA_AM_MOD_EN</name>
                     <description>RF Power Amplifier Amplitude Modulation Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RF_DFT_BIST_2</name>
               <description>TX DFT Control 2</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>SYN_BIST_GO</name>
                     <description>Start the PLL Frequency Synthesizer BIST</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYN_BIST_FINISHED</name>
                     <description>PLL Frequency Synthesizer BIST has finished trying to lock to Radio Channels</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SYN_BIST_RESULT</name>
                     <description>PLL Frequency Synthesizer BIST Result</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SYN_BIST_ALL_CHANNELS</name>
                     <description>PLL Frequency Synthesizer BIST All Channels</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FREQ_COUNT_THRESHOLD</name>
                     <description>Frequency Meter Count Difference Threshold</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>HPM_INL_BIST_GO</name>
                     <description>Start the High Port Modulator DAC INL BIST</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HPM_INL_BIST_FINISHED</name>
                     <description>High Port Modulator DAC INL BIST has finished measuring the INL of the HPM DAC</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HPM_INL_BIST_RESULT</name>
                     <description>High Port Modulator DAC INL BIST Result</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HPM_DNL_BIST_GO</name>
                     <description>Start the High Port Modulator DAC DNL BIST</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HPM_DNL_BIST_FINISHED</name>
                     <description>High Port Modulator DAC DNL BIST has finished measuring the DNL of the HPM DAC</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HPM_DNL_BIST_RESULT</name>
                     <description>High Port Modulator DAC DNL BIST Result</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DFT_MAX_RAM_SIZE</name>
                     <description>Maximum RAM Address to use as Modulation</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
